`timescale 1ns / 1ps

module testbench();
reg[3:0] x;
wire a,b,c;

initial
begin
   x = 4'b0000;     //输入0，输出0
   #10 x = 4'b0001; //输入1，输出1
   #10 x = 4'b0010; //输入2，输出1
   #10 x = 4'b0011; //输入3，输出2
   #10 x = 4'b0100; //输入4，输出2
   #10 x = 4'b0101; //输入5，输出2
   #10 x = 4'b0110; //输入6，输出2
   #10 x = 4'b0111; //输入7，输出3
   #10 x = 4'b1000; //输入8，输出3
   #10 x = 4'b1001; //输入9，输出3
   #10 x = 4'b1010; //输入10，输出3
   #10 x = 4'b1011; //输入11，输出3
   #10 x = 4'b1100; //输入12，输出3
   #10 x = 4'b1101; //输入13，输出4
   #10 x = 4'b1110; //输入14，输出4
   #10 x = 4'b1111; //输入15，输出4
end

calculate cal(
    .X(x),
    .A(a),
    .B(b),
    .C(c)
);

endmodule